{"17571": {"actual": "<ul><li>1 cup all-purpose flour</li><li>1 egg</li><li>2 cups milk</li><li>In a mixing bowl, combine flour, egg, and milk.</li><li>Heat a large skillet or crepe pan over a medium-high heat. Spray the pan with non-stick cooking spray. Pour about 1/3 cup of batter into the pan, lift the pan and turn it by rotating your wrist, spreading a PAPER THIN amount in the pan. Flip the crepe when it starts to bubble. When it is finished cooking, remove it and repeat this process with the remaining batter.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in the preheated oven to the onion and garlic in</li></ul>", "ttl": "Real French Crepes"}, "20179": {"actual": "<ul><li>3/4 cup cornmeal</li><li>3 3/4 cups water</li><li>1 tablespoon salt</li><li>3 tablespoons olive oil</li><li>1/4 cup honey</li><li>3 (.25 ounce) packages instant yeast</li><li>1 cup rye flour</li><li>1 cup whole wheat flour</li><li>8 cups unbleached flour</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a small saucepan, combine the cornmeal and water. Bring to a boil and cook for 5 minutes. Pour into a large mixing bowl. Stir in salt, oil and honey; let cool until lukewarm.</li><li>In a large bowl, combine the cooled cornmeal mixture with the yeast, rye flour, whole wheat flour and 4 cups unbleached flour; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Allow dough to rise 30 minutes, or until doubled.</li><li>Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).</li><li>Bake in preheated oven for 40 minutes, or until bottoms of the loaves sound hollow when tapped. Remove from pans and allow to cool on a wire rack.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the mixture to the onion and garlic in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil and stir in the preheated oven until the chicken breasts in the center and the eggs to a boil</li></ul>", "ttl": "Honey Multigrain Bread"}, "20177": {"actual": "<ul><li>1 1/4 cups all-purpose flour</li><li>1/2 teaspoon salt</li><li>1 tablespoon baking powder</li><li>1 1/4 teaspoons white sugar</li><li>1 egg</li><li>1 cup milk</li><li>1/2 tablespoon butter, melted</li><li>1/2 cup frozen blueberries, thawed</li><li>In a large bowl, sift together flour, salt, baking powder and sugar. In a small bowl, beat together egg and milk. Stir milk and egg into flour mixture. Mix in the butter and fold in the blueberries. Set aside for 1 hour.</li><li>Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over the chicken breasts in the center should</li></ul>", "ttl": "Todd's Famous Blueberry Pancakes"}, "14676": {"actual": "<ul><li>1 egg</li><li>2 (10.75 ounce) cans condensed tomato soup</li><li>1/4 cup instant rice</li><li>1/4 cup chopped onion</li><li>1 tablespoon chopped fresh parsley</li><li>1 teaspoon onion salt</li><li>1/4 teaspoon ground black pepper</li><li>1 pound lean ground beef</li><li>1/4 cup Worcestershire sauce</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Lightly beat egg with a fork, then add a heaping tablespoon of the soup and mix lightly. Mix in rice, onion, parsley, onion salt and pepper. Stir in the ground beef and mix well with hands. From mixture into 1 1/2 inch round meatballs.</li><li>Coat a large skillet over medium heat with cooking spray. Cook meatballs and brown on all sides.</li><li>Combine remaining soup with Worcestershire (you can increase or decrease Worcestershire to your liking), stir until smooth, then spoon over meatballs. Cover with lid and simmer for 20 to 30 minutes, stirring every few minutes.</li><li></li></ul>", "rnn": "<ul><li>1 cup chopped fresh cup chopped fresh and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried</li></ul>", "ttl": "Zesty Porcupine Meatballs"}, "8626": {"actual": "<ul><li>1/4 cup vegetable oil</li><li>1/3 cup honey</li><li>1/3 cup soy sauce</li><li>1/4 teaspoon ground black pepper</li><li>8 skinless, boneless chicken breast halves - cut into 1 inch cubes</li><li>2 cloves garlic</li><li>5 small onions, cut into 2 inch pieces</li><li>2 red bell peppers, cut into 2 inch pieces</li><li>skewers</li><li>In a large bowl, whisk together oil, honey, soy sauce, and pepper. Before adding chicken, reserve a small amount of marinade to brush onto kabobs while cooking. Place the chicken, garlic, onions and peppers in the bowl, and marinate in the refrigerator at least 2 hours (the longer the better).</li><li>Preheat the grill for high heat.</li><li>Drain marinade from the chicken and vegetables, and discard marinade. Thread chicken and vegetables alternately onto the skewers.</li><li>Lightly oil the grill grate. Place the skewers on the grill. Cook for 12 to 15 minutes, until chicken juices run clear. Turn and brush with reserved marinade frequently.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. remove the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Yummy Honey Chicken Kabobs"}, "26399": {"actual": "<ul><li>1 (2 to 3 pound) whole chicken, skin removed and cut into pieces</li><li>1 onion, chopped</li><li>1 carrot, peeled and sliced</li><li>1 stalk celery, chopped</li><li>6 black peppercorns</li><li>1 bay leaf</li><li>salt and pepper to taste</li><li>1 quart water, or as needed</li><li>1 (8 ounce) can creamed corn</li><li>In a large saucepan or wok over medium heat, combine chicken, onion, carrot, celery, peppercorns, bay leaf, salt, pepper and water. Bring to a boil, then reduce heat and simmer 30 minutes. Strain stock and reserve chicken.</li><li>Return strained stock to pot and stir in creamed corn. Bring to a boil, then reduce heat and simmer 5 minutes. Shred cooked chicken meat and stir into pot. Heat through.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups fresh lemon juice, and stir in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken</li></ul>", "ttl": "Corn and Chicken Soup"}, "21276": {"actual": "<ul><li>4 pounds crabmeat</li><li>1 egg</li><li>1 tablespoon lemon zest</li><li>1/8 teaspoon Old Bay Seasoning TM</li><li>2 tablespoons fresh basil, chopped</li><li>1 cup saltine crackers, crushed</li><li>1 cup mayonnaise</li><li>4 tablespoons vegetable oil</li><li>3 egg yolks</li><li>1/8 teaspoon Old Bay Seasoning TM</li><li>3 ounces fresh lime juice</li><li>2 tablespoons chopped fresh cilantro</li><li>salt and pepper to taste</li><li>1 3/4 cups vegetable oil</li><li>In a large mixing bowl, combine crabmeat, 1 egg, lemon zest, Old Bay Seasoning, chopped basil, crushed crackers and mayonnaise. Mix thoroughly.</li><li>Form 5 ounce patties out of the crab mixture (should make about 16 patties), and chill until cold before cooking.</li><li>In a skillet, heat 4 tablespoons of oil over medium heat. Saute the crab cakes for 4 minutes on each side or until golden brown.</li><li>For the sauce, in a blender place the egg yolks, Old Bay Seasoning, lime juice, cilantro, salt and pepper. Blend for 10 seconds. Keeping the blender running, slowly drizzle the oil into the blender. Blend until sauce is creamy.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the mixture to the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175</li></ul>", "ttl": "Crab Cakes III"}, "18015": {"actual": "<ul><li>2 eggs, beaten</li><li>3 very ripe bananas, mashed</li><li>2 cups all-purpose flour</li><li>1 teaspoon salt</li><li>3/4 cup white sugar</li><li>1 teaspoon baking soda</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C). Lightly grease or line 10 muffin cups.</li><li>In a medium bowl, combine eggs and bananas. In a separate bowl, mix together flour, salt, sugar and baking soda. Stir banana mixture into flour mixture. Fold in walnuts if desired. Pour batter into prepared muffin cups.</li><li>Bake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into center of a muffin comes out clean.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the mixture to the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to a boil and stir in the center and the mixture to</li></ul>", "ttl": "Lighter Banana Muffins"}, "15368": {"actual": "<ul><li>6 eggs</li><li>1/2 teaspoon paprika</li><li>2 tablespoons mayonnaise</li><li>1/2 teaspoon mustard powder</li><li>Place eggs in a pot of salted water. Bring the water to a boil, and let eggs cook in boiling water until they are hard boiled, approximately 10 to 15 minutes. Drain eggs, and let cool.</li><li>Cut eggs in half, lengthwise. Remove the egg yolks and mash them together in a small mixing bowl. Mix in the paprika, mayonnaise, and dry mustard. Spoon mixture into the egg whites; cool and serve.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees</li></ul>", "ttl": "Deviled Eggs I"}, "11669": {"actual": "<ul><li>2 (14.5 ounce) cans Italian-style diced tomatoes</li><li>1 (19 ounce) can cannellini beans, drained and rinsed</li><li>10 ounces fresh spinach, washed and chopped</li><li>8 ounces penne pasta</li><li>1/2 cup crumbled feta cheese</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Cook the pasta in a large pot of boiling salted water until al dente.</li><li>Meanwhile, combine tomatoes and beans in a large non-stick skillet. Bring to a boil over medium high heat. Reduce heat, and simmer 10 minutes.</li><li>Add spinach to the sauce; cook for 2 minutes or until spinach wilts, stirring constantly.</li><li>Serve sauce over pasta, and sprinkle with feta.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Greek Pasta with Tomatoes and White Beans"}, "8509": {"actual": "<ul><li>2/3 cup dry potato flakes</li><li>1/3 cup grated Parmesan cheese</li><li>1 teaspoon garlic salt</li><li>1 (3 pound) chicken, skin removed, cut into pieces</li><li>1/3 cup butter, melted</li><li>Heat oven to 375 degrees F (190 degrees C). Grease or line with foil a baking sheet or a 13 x 9 inch baking pan.</li><li>In a medium bowl, combine potato flakes, Parmesan cheese, and garlic salt. Stir until well mixed.</li><li>Dip chicken pieces into melted butter or margarine, and roll in potato flake mixture to coat. Place in prepared pan.</li><li>Bake for 45 to 60 minutes, or until chicken is tender and golden brown.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Crispy Herb Baked Chicken"}, "33234": {"actual": "<ul><li>1 French baguette, cut into diagonal 1/2 inch slices</li><li>3 tablespoons extra virgin olive oil</li><li>4 cloves garlic, halved</li><li>6 plum tomatoes, seeded and chopped</li><li>1 bunch fresh basil, julienned</li><li>1 pound fresh mozzarella cheese, sliced</li><li>Preheat the oven's broiler. Brush the slices of bread lightly with olive oil, and place on a baking sheet. Toast under the broiler for about 3 minutes. Watch carefully. Rub each crostini with a garlic clove for flavor.</li><li>Place the tomatoes into a medium bowl, and drizzle with olive oil. Season with salt and pepper.</li><li>Place the crostini on a serving tray. Top each one with a slice of mozzarella cheese, cover with a spoonful of tomatoes, and garnish with fresh basil.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir in the center should read at least 165 degrees f (175 degrees c). #END# and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and stir</li></ul>", "ttl": "Crostini with Mozzarella and Tomato"}, "22180": {"actual": "<ul><li>2 eggs</li><li>2 cups all-purpose flour</li><li>1 3/4 cups milk</li><li>1/2 cup vegetable oil</li><li>1 tablespoon white sugar</li><li>4 teaspoons baking powder</li><li>1/4 teaspoon salt</li><li>1/2 teaspoon vanilla extract</li><li>Preheat waffle iron. Beat eggs in large bowl with hand beater until fluffy. Beat in flour, milk, vegetable oil, sugar, baking powder, salt and vanilla, just until smooth.</li><li>Spray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add all ingredients to list</li><li>add</li></ul>", "ttl": "Waffles I"}, "19402": {"actual": "<ul><li>1/2 cup butter</li><li>1 (8 ounce) package cream cheese</li><li>2 teaspoons garlic powder</li><li>2 cups milk</li><li>6 ounces grated Parmesan cheese</li><li>1/8 teaspoon ground black pepper</li><li>Melt butter in a medium, non-stick saucepan over medium heat. Add cream cheese and garlic powder, stirring with wire whisk until smooth. Add milk, a little at a time, whisking to smooth out lumps. Stir in Parmesan and pepper. Remove from heat when sauce reaches desired consistency. Sauce will thicken rapidly, thin with milk if cooked too long. Toss with hot pasta to serve.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Quick and Easy Alfredo Sauce"}, "16679": {"actual": "<ul><li>6 tablespoons unsalted butter, softened</li><li>1/4 cup olive oil</li><li>1 tablespoon minced garlic</li><li>1 tablespoon minced shallots</li><li>2 tablespoons minced fresh chives</li><li>salt and freshly ground black pepper to taste</li><li>1/2 teaspoon paprika</li><li>2 pounds large shrimp - peeled and deveined</li><li>Preheat grill for high heat.</li><li>In a large bowl, mix together softened butter, olive oil, garlic, shallots, chives, salt, pepper, and paprika; add the shrimp, and toss to coat.</li><li>Lightly oil grill grate. Cook the shrimp as close to the flame as possible for 2 to 3 minutes per side, or until opaque.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 teaspoon ground black pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to</li></ul>", "ttl": "Garlicky Appetizer Shrimp Scampi"}, "33092": {"actual": "<ul><li>8 slices oatnut bread</li><li>1/2 (8 ounce) package cream cheese, softened</li><li>1/2 cup seedless raspberry jam</li><li>5 eggs, beaten</li><li>1/4 cup milk</li><li>1 1/2 teaspoons almond extract</li><li>1 tablespoon butter</li><li>Spread 4 slices oatnut bread on one side with cream cheese. Spread remaining 4 slices on one side with raspberry jam. Press cream cheese slices together with jam slices, forming sandwiches.</li><li>In a medium, shallow bowl, beat together the eggs, milk and almond extract.</li><li>Melt butter in a large, heavy skillet over medium high heat. Dip sandwiches in the egg mixture to coat. Place in the skillet, and cook on both sides until golden brown.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the chicken and stir in the center and the</li></ul>", "ttl": "Stuffed French Toast II"}, "18775": {"actual": "<ul><li>4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness</li><li>2 teaspoons seasoning salt</li><li>6 slices bacon, cut in half</li><li>1/2 cup prepared yellow mustard</li><li>1/2 cup honey</li><li>1/4 cup light corn syrup</li><li>1/4 cup mayonnaise</li><li>1 tablespoon dried onion flakes</li><li>1 tablespoon vegetable oil</li><li>1 cup sliced fresh mushrooms</li><li>2 cups shredded Colby-Monterey Jack cheese</li><li>2 tablespoons chopped fresh parsley</li><li>Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes.</li><li>Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside.</li><li>In a medium bowl, combine the mustard, honey, corn syrup, mayonnaise and dried onion flakes. Remove half of sauce, cover and refrigerate to serve later.</li><li>Heat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese.</li><li>Bake in preheated oven for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley and serve with the reserved honey mustard sauce.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Aussie Chicken"}, "15352": {"actual": "<ul><li>2 teaspoons cornstarch</li><li>2 tablespoons rice wine</li><li>1 tablespoon lemon juice</li><li>1 tablespoon soy sauce</li><li>1 dash hot pepper sauce</li><li>1 tablespoon grated fresh ginger</li><li>1 clove crushed garlic</li><li>1 pound skinless, boneless chicken breast halves, cut into bite size pieces</li><li>2 tablespoons sesame seeds</li><li>1 tablespoon sesame oil</li><li>2 tablespoons vegetable oil</li><li>4 ounces fresh mushrooms, quartered</li><li>1 green bell pepper, sliced</li><li>4 green onions, sliced diagonally into 1/2 inch pieces</li><li>To Make Marinade: In a nonporous dish or bowl blend cornstarch with wine or sherry; then stir in lemon juice, soy sauce, hot pepper sauce, ginger and garlic. Blend together and stir in chicken strips. Cover dish and refrigerate to marinate for 3 to 4 hours.</li><li>In a wok or large skillet, place sesame seeds and dry-fry over medium heat, shaking the wok, until the seeds are a golden brown color. Remove seeds and set aside.</li><li>To same wok or skillet add sesame oil and vegetable oil and heat slowly. Drain chicken, reserving marinade, and stir-fry in wok a few pieces at a time, until browned. Remove chicken with a slotted spoon and set aside.</li><li>Add mushrooms and green bell pepper to same wok or skillet and stir-fry for 2 to 3 minutes. Add the scallions and stir-fry 1 minute more. Return chicken to wok, together with reserved marinade, and stir over medium high heat for another 2 to 3 minutes, or until the ingredients are evenly coated with the glaze. Sprinkle toasted sesame seeds on top and serve immediately.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the</li></ul>", "ttl": "Sesame Chicken"}, "14064": {"actual": "<ul><li>2 avocados</li><li>1 small onion, finely chopped</li><li>1 clove garlic, minced</li><li>1 ripe tomato, chopped</li><li>1 lime, juiced</li><li>salt and pepper to taste</li><li>Peel and mash avocados in a medium serving bowl. Stir in onion, garlic, tomato, lime juice, salt and pepper. Season with remaining lime juice and salt and pepper to taste. Chill for half an hour to blend flavors.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon olive oil in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the</li></ul>", "ttl": "Easy Guacamole"}, "47822": {"actual": "<ul><li>1/4 cup brown sugar</li><li>2 teaspoons ground ginger</li><li>2 teaspoons dried tarragon</li><li>1 teaspoon ground cinnamon</li><li>1 teaspoon ground black pepper</li><li>1 teaspoon garlic powder</li><li>1/2 teaspoon salt</li><li>4 lamb chops</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a medium bowl, mix brown sugar, ginger, tarragon, cinnamon, pepper, garlic powder, and salt. Rub lamb chops with the seasonings, and place on a plate. Cover, and refrigerate for 1 hour.</li><li>Preheat grill for high heat.</li><li>Brush grill grate lightly with oil, and arrange lamb chops on grill. Cook 5 minutes on each side, or to desired doneness.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Grilled Lamb with Brown Sugar Glaze"}, "14039": {"actual": "<ul><li>2 tablespoons butter</li><li>2 cups fresh sliced mushrooms</li><li>2 cups torn spinach leaves</li><li>6 green onions, chopped</li><li>1 (8 ounce) package refrigerated crescent rolls</li><li>1 (1 ounce) package herb and lemon soup mix</li><li>1/2 cup half-and-half</li><li>4 eggs, beaten</li><li>1 cup shredded Monterey Jack cheese</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 375 degrees F (190 degrees C).</li><li>Melt margarine in a skillet over medium heat and cook mushrooms, spinach and onions for 5 minutes or until tender, stir continuously. Remove the skillet from heat.</li><li>In a 9 inch round pan or pie plate coated with non-stick cooking spray arrange crescent roll triangles in a circle, with narrow tips hung over the rim of the pie plate about 2 inches. Press dough onto the bottom and side of the pie plate to fill in any gaps.</li><li>In a medium bowl stir together the soup mix, half and half cream and eggs. Stir the cheese and cooked vegetables into the egg mixture until blended. Pour into the prepared crust. Fold the points of dough that are hanging over the edge back in over the filling.</li><li>Bake the quiche for 30 minutes in the preheated oven, or until a knife inserted into the center comes out clean.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees c). the chicken breasts in the</li></ul>", "ttl": "Spinach Mushroom Quiche"}, "16664": {"actual": "<ul><li>1/2 cup butter</li><li>3 cloves garlic, chopped</li><li>1 small onion, chopped</li><li>1 (10 ounce) package frozen chopped spinach, thawed and drained</li><li>1 (4.5 ounce) can mushrooms, drained</li><li>1 (6 ounce) package herb and garlic feta, crumbled</li><li>1 (8 ounce) package shredded Cheddar cheese</li><li>salt and pepper to taste</li><li>1 (9 inch) unbaked deep dish pie crust</li><li>4 eggs, beaten</li><li>1 cup milk</li><li>salt and pepper to taste</li><li>Preheat oven to 375 degrees F (190 degrees C).</li><li>In a medium skillet, melt butter over medium heat. Saute garlic and onion in butter until lightly browned, about 7 minutes. Stir in spinach, mushrooms, feta and 1/2 cup Cheddar cheese. Season with salt and pepper. Spoon mixture into pie crust.</li><li>In a medium bowl, whisk together eggs and milk. Season with salt and pepper. Pour into the pastry shell, allowing egg mixture to thoroughly combine with spinach mixture.</li><li>Bake in preheated oven for 15 minutes. Sprinkle top with remaining Cheddar cheese, and bake an additional 35 to 40 minutes, until set in center. Allow to stand 10 minutes before serving.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Spinach Quiche"}, "25285": {"actual": "<ul><li>1/2 pound fresh green beans, cut into 1-inch lengths</li><li>2 carrots, cut into thick strips</li><li>1/4 cup butter</li><li>1 onion, sliced</li><li>1/2 pound fresh mushrooms, sliced</li><li>1 teaspoon salt</li><li>1/2 teaspoon seasoned salt</li><li>1/4 teaspoon garlic salt</li><li>1/4 teaspoon white pepper</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Place green beans and carrots in 1 inch of boiling water. Cover, and cook until tender but still firm. Drain.</li><li>Melt butter in a large skillet over medium heat. Saute onions and mushrooms until almost tender. Reduce heat, cover, and simmer 3 minutes. Stir in green beans, carrots, salt, seasoned salt, garlic salt, and white pepper. Cover, and cook for 5 minutes over medium heat.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and</li></ul>", "ttl": "Green Bean and Mushroom Medley"}, "6907": {"actual": "<ul><li>1/3 cup butter</li><li>1 cup packed brown sugar</li><li>3 teaspoons ground cinnamon</li><li>2 cups all-purpose flour</li><li>2 tablespoons white sugar</li><li>4 teaspoons baking powder</li><li>1 teaspoon salt</li><li>1/4 cup butter, chilled</li><li>1 cup cold milk</li><li>1/3 cup currants</li><li>1/2 cup confectioners' sugar, sifted</li><li>3 tablespoons milk</li><li>Preheat oven to 400 degrees F (200 degrees C). Grease the bottoms and sides of a 12-cup muffin tin.</li><li>Cream 1/3 cup butter, brown sugar, and cinnamon together. Drop 1 teaspoon into each muffin cup. Reserve the remaining mixture.</li><li>In a large bowl, combine flour, sugar, baking powder, and salt. Cut in 1/4 cup cold butter until crumbly. Make a well in center, and pour in the milk. Stir to form a soft dough, adding a bit more milk if needed.</li><li>Turn the dough out on lightly floured surface. Knead 8 to 10 times. Pat dough into rectangle about 1/3 inch thick and 12 inches long. Spread the remaining cinnamon mixture over dough rectangle. Sprinkle currants over top. Roll up like a jelly roll into a long log. Mark the dough first, to make sure you know where to cut, then cut the log into 12 slices. Place cut-side down in the prepared muffin pan.</li><li>Bake in in the preheated oven until golden brown, 20 to 25 minutes. Turn rolls out on a serving tray.</li><li>For the glaze, add milk to the confectioners' sugar and stir well, adding more liquid if necessary to make a thin glaze. Drizzle over cinnamon rolls.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken</li></ul>", "ttl": "Jiffy Cinnamon Rolls"}, "26921": {"actual": "<ul><li>1 clove garlic</li><li>1 (19 ounce) can garbanzo beans, half the liquid reserved</li><li>4 tablespoons lemon juice</li><li>2 tablespoons tahini</li><li>1 clove garlic, chopped</li><li>1 teaspoon salt</li><li>black pepper to taste</li><li>2 tablespoons olive oil</li><li>In a blender, chop the garlic. Pour garbanzo beans into blender, reserving about a tablespoon for garnish. Place lemon juice, tahini, chopped garlic and salt in blender. Blend until creamy and well mixed.</li><li>Transfer the mixture to a medium serving bowl. Sprinkle with pepper and pour olive oil over the top. Garnish with reserved garbanzo beans.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to</li></ul>", "ttl": "Real Hummus"}, "18870": {"actual": "<ul><li>1/4 cup honey</li><li>2 tablespoons prepared Dijon-style mustard</li><li>2 tablespoons chopped fresh rosemary</li><li>1 teaspoon freshly ground black pepper</li><li>1 teaspoon lemon zest</li><li>3 cloves garlic, minced</li><li>5 pounds whole leg of lamb</li><li>1 teaspoon coarse sea salt</li><li>In a small bowl, combine the honey, mustard, rosemary, ground black pepper, lemon zest and garlic. Mix well and apply to the lamb. Cover and marinate in the refrigerator overnight.</li><li>Preheat oven to 450 degrees F (230 degrees C).</li><li>Place lamb on a rack in a roasting pan and sprinkle with salt to taste.</li><li>Bake at 450 degrees F (230 degrees C) for 20 minutes, then reduce heat to 400 degrees F (200 degrees C) and roast for 55 to 60 more minutes for medium rare. The internal temperature should be at least 145 degrees F (63 degrees C) when taken with a meat thermometer. Let the roast rest for about 10 minutes before carving.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Roast Leg of Lamb with Rosemary"}, "18873": {"actual": "<ul><li>2 tablespoons vegetable oil</li><li>2 onions, chopped</li><li>4 potatoes, peeled and chopped</li><li>2 (12 ounce) cans corned beef</li><li>1 tablespoon ground black pepper</li><li>5 tablespoons cider vinegar</li><li>Heat oil in a large skillet over medium high heat. Saute onions and potatoes until slightly browned, then stir in corned beef. Season with pepper and add vinegar 1 tablespoon at a time, cooking for 3 to 5 minutes in between each addition. Partially cover skillet, reduce heat to medium-low and cook, stirring occasionally, for about 20 minutes or until potatoes are tender.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175</li></ul>", "ttl": "One Skillet Corned Beef Hash"}, "12398": {"actual": "<ul><li>1 cup all-purpose flour</li><li>1 cup white sugar</li><li>1/4 teaspoon salt</li><li>2 cups cranberries</li><li>1/2 cup chopped walnuts</li><li>1/2 cup butter, melted</li><li>2 eggs</li><li>1 teaspoon almond extract</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease one 9 inch pie pan.</li><li>Combine the flour, sugar, and salt. Stir in the cranberries and the walnuts, and toss to coat. Stir in the butter, beaten eggs, and almond extract. If you are using frozen cranberries, the mixture will be very thick. Spread the batter into the prepared pan.</li><li>Bake at 350 degrees F (175 degrees C) for 40 minutes, or until a wooden pick inserted near the center comes out clean. Serve warm with whipped cream or ice cream.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and</li></ul>", "ttl": "Crustless Cranberry Pie"}, "16727": {"actual": "<ul><li>4 potatoes</li><li>4 eggs</li><li>1/2 stalk celery, chopped</li><li>1/4 cup sweet relish</li><li>1 clove garlic, minced</li><li>2 tablespoons prepared mustard</li><li>1/2 cup mayonnaise</li><li>salt and pepper to taste</li><li>Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes; drain and chop.</li><li>Place eggs in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water; peel and chop.</li><li>In a large bowl, combine the potatoes, eggs, celery, sweet relish, garlic, mustard, mayonnaise and salt and pepper. Gently mix together and serve warm.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Southern Potato Salad"}, "15023": {"actual": "<ul><li>4 bone-in chicken breast halves, with skin</li><li>4 tablespoons butter</li><li>1 tablespoon dried basil</li><li>1 teaspoon garlic salt</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>Place chicken breasts in a lightly greased 9x13 inch baking dish or roasting pan. Dot each breast with 1 tablespoon of butter or margarine, then season each breast with dried basil and garlic salt to taste.</li><li>Bake at 350 degrees F (175 degrees C) for approximately 1 to 1 1/4 hours.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (74 degrees f (175 degrees c). to a boil and stir in the center</li></ul>", "ttl": "Mondi's Super Simple Chicken"}, "14196": {"actual": "<ul><li>1 1/2 pounds fresh strawberries, rinsed and sliced</li><li>2 1/2 tablespoons brown sugar</li><li>1 tablespoon balsamic vinegar</li><li>1/4 teaspoon freshly ground black pepper</li><li>In a large bowl, toss berries with sugar and let stand at room temperature for 10 minutes.</li><li>In a small bowl, combine the vinegar and pepper. Pour over berries and toss to coat. Divide berries among 4 serving bowls and serve. Enjoy!</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Sweet and Tart Strawberry Salad"}, "14518": {"actual": "<ul><li>2 pounds boneless, skinless chicken thighs</li><li>adobo seasoning to taste</li><li>12 (10 inch) flour tortillas</li><li>1 1/2 cups shredded Mexican cheese blend</li><li>1 onion, chopped</li><li>1 (6 ounce) can sliced black olives, drained</li><li>1 (7 ounce) can diced green chilies, drained</li><li>Place the chicken on a plate, and sprinkle with adobo seasoning on both sides. Let it marinate for 15 minutes.</li><li>Heat grill for medium-high heat.</li><li>Lightly oil the grill grate. Place chicken on grill, and cook for 10 minutes per side, or until juices run clear. Remove chicken from grill, and cut into bite-size pieces.</li><li>Place one or two tortillas on the grill, and sprinkle with a thin layer of cheese, chicken, onion, olives, and chiles. Top with another tortilla, and grill until brown and crispy on both sides, about 3 minutes per side. Repeat with remaining ingredients. Cut into wedges to serve.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Grilled Chicken Quesadillas"}, "10602": {"actual": "<ul><li>1 cup butter</li><li>1/2 cup packed brown sugar</li><li>1 teaspoon vanilla extract</li><li>3 cups quick cooking oats</li><li>1 cup semisweet chocolate chips</li><li>1/2 cup peanut butter</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Grease a 9x9 inch square pan.</li><li>Melt butter in large saucepan over medium heat. Stir in brown sugar and vanilla. Mix in the oats. Cook over low heat 2 to 3 minutes, or until ingredients are well blended. Press half of mixture into the bottom of the prepared pan. Reserve the other half for topping.</li><li>Meanwhile, melt chocolate chips and peanut butter in a small heavy saucepan over low heat, stirring frequently until smooth. Pour the chocolate mixture over the crust in the pan, and spread evenly with a knife or the back of a spoon.</li><li>Crumble the remaining oat mixture over the chocolate layer, pressing in gently. Cover, and refrigerate 2 to 3 hours or overnight. Bring to room temperature before cutting into bars.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and</li></ul>", "ttl": "No Bake Chocolate Oat Bars"}, "13022": {"actual": "<ul><li>4 boneless chicken breast halves, cooked and shredded</li><li>2 (14.5 ounce) cans chicken broth</li><li>1 (4 ounce) can diced green chiles</li><li>1 (10 ounce) can diced tomatoes with green chile peppers</li><li>1 onion, chopped</li><li>2 cloves garlic, minced</li><li>1 tablespoon fresh lime juice</li><li>2 tablespoons chopped fresh cilantro</li><li>1/2 teaspoon ground cayenne pepper</li><li>1/2 teaspoon ground cumin</li><li>4 (10 inch) flour tortillas</li><li>1 tablespoon olive oil</li><li>Combine the chicken broth, green chilies, tomatoes with green chilies, onion, and garlic in a soup pot. Add the shredded chicken. Bring to a boil, stirring frequently. Reduce heat and simmer for 30-35 minutes.</li><li>Add the lime juice, cilantro, cayenne, and cumin. Simmer for 10-15 minutes longer.</li><li>Cut the tortillas into 1/2 x 2-inch strips. Fry in hot olive oil in skillet until golden brown; drain on paper towels.</li><li>Ladle the soup into bowls. Garnish with shredded Monterey Jack cheese and the tortilla strips.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken</li></ul>", "ttl": "Tortilla Soup II"}, "16061": {"actual": "<ul><li>4 eggs</li><li>2 cups grated zucchini</li><li>3/4 cup all-purpose flour</li><li>1/2 teaspoon white sugar</li><li>1/2 teaspoon salt</li><li>3 tablespoons olive oil</li><li>4 teaspoons baking powder</li><li>1/4 cup butter, melted</li><li>Preheat grill to 425 to 450 degrees F (220 to 225 degrees C).</li><li>In a large mixing bowl, beat eggs, add shredded zucchini and mix well using a fork. Add flour, sugar, salt and vegetable oil and stir to blend well. Finally, add baking powder and mix well using a large spoon. The batter's consistency should be like heavy whipping cream.</li><li>Spoon batter on hot grill (about 2 tablespoons) for each pancake. Cook until there are no longer bubbles forming in the pancake about 2 minutes; turn over and cook for 2 minutes longer. Rub pancakes with melted butter and serve immediately.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Zucchini Pancakes"}, "12155": {"actual": "<ul><li>3 cups fresh blueberries</li><li>1 (9 inch) deep dish pie crust</li><li>For the Custard:</li><li>1 cup white sugar</li><li>1/3 cup all-purpose flour</li><li>1/8 teaspoon salt</li><li>2 eggs, beaten</li><li>1/2 cup sour cream</li><li>For the Streusel:</li><li>1/2 cup white sugar</li><li>1/2 cup all-purpose flour</li><li>1/4 cup butter</li><li>Preheat oven to 350 degrees F (175 degrees C). Place the blueberries in the pastry shell and set aside.</li><li>Combine 1 cup sugar, 1/3 cup flour, and salt. Add eggs and sour cream, stirring until blended. Pour the sour cream custard over the blueberries.</li><li>In another bowl, combine 1/2 cup sugar and 1/2 cup flour. Cut in the butter with pastry blender until the mixture resembles coarse meal. Sprinkle the topping over the sour cream mixture and berries in the pie shell.</li><li>Bake in the preheated oven for 50 to 55 minutes, or until lightly browned. Cool on wire rack.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the mixture to the center and the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Creamy Blueberry Pie"}, "7883": {"actual": "<ul><li>1 (18.25 ounce) package yellow cake mix</li><li>1 (3.5 ounce) package instant banana pudding mix</li><li>4 eggs</li><li>1 cup water</li><li>1/4 cup vegetable oil</li><li>3/4 cup mashed bananas</li><li>2 cups confectioners' sugar</li><li>2 tablespoons milk</li><li>1 dash vanilla extract</li><li>1/2 cup chopped walnuts (optional)</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.</li><li>In a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in eggs, water, oil and mashed banana. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.</li><li>Bake in a preheated oven for 50 to 55 minutes, or until cake tests done. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.</li><li>To make glaze: In a small bowl, combine confectioners' sugar, milk and vanilla. Whisk until smooth and of a drizzling consistency. When cake is cooled, drizzle icing over cake with a zigzag motion. Sprinkle chopped nuts over wet icing if desired.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Banana Pudding Cake"}, "25800": {"actual": "<ul><li>6 cups all-purpose flour</li><li>1 teaspoon baking soda</li><li>1/2 teaspoon baking powder</li><li>1 1/2 teaspoons salt</li><li>4 teaspoons ground ginger</li><li>4 teaspoons ground cinnamon</li><li>1 1/2 teaspoons ground cloves</li><li>1 teaspoon ground black pepper</li><li>1 cup unsalted butter, softened</li><li>1 cup packed brown sugar</li><li>2 eggs</li><li>1 cup unsulfured molasses</li><li>Sift together the flour, baking soda, baking powder, salt, ginger, cinnamon, cloves, and black pepper; set aside. In a large bowl, or stand mixer with the paddle attachment, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the molasses. Gradually mix in the sifted ingredients. Divide the dough into thirds and wrap in plastic wrap. Refrigerate for at least one hour.</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>On a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.</li><li>Bake for 8 to 10 minutes in the preheated oven, until cookies are crisp but not dark. Remove to wire racks to cool completely. Decorate as desired.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon ground black pepper to taste</li><li>1 tablespoon dried cup chopped fresh lemon juice, the chicken breasts in the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a large bowl. the chicken breasts in a</li></ul>", "ttl": "Basic Gingersnap Cookies"}, "15735": {"actual": "<ul><li>4 skinless, boneless chicken breast halves - cooked and diced</li><li>1 stalk celery, chopped</li><li>1/2 onion, chopped</li><li>1 small apple - peeled, cored and chopped</li><li>1/3 cup golden raisins</li><li>1/3 cup seedless green grapes, halved</li><li>1/2 cup chopped toasted pecans</li><li>1/8 teaspoon ground black pepper</li><li>1/2 teaspoon curry powder</li><li>3/4 cup mayonnaise</li><li>In a large salad bowl combine the chicken, celery, onion, apple, raisins, grapes, pecans, pepper, curry powder and mayonnaise. Mix all together, tossing to coat. Salad is ready to serve!</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a large bowl. to taste</li><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees c).</li></ul>", "ttl": "Fruited Curry Chicken Salad"}, "21321": {"actual": "<ul><li>10 large shrimp, heads off and unpeeled</li><li>1 tablespoon olive oil</li><li>3 cloves garlic, minced</li><li>4 tablespoons butter</li><li>1/2 teaspoon dried oregano</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>With a sharp knife, cut shrimp in half so that the meat is exposed in the shell.</li><li>In a small saucepan, heat olive oil and lightly fry the garlic until just softened. Add butter and Oregano. Heat until butter has melted.</li><li>Preheat an outdoor grill for medium heat and lightly oil grate.</li><li>Lay shrimp out on a tray and brush generously with the butter mixture. Grill shrimp until lightly golden.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. remove the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in</li></ul>", "ttl": "Grilled Scampi"}, "16719": {"actual": "<ul><li>4 eggs</li><li>3/4 cup milk</li><li>3 tablespoons brown sugar</li><li>1 teaspoon ground nutmeg</li><li>12 slices white bread</li><li>1 tablespoon ground cinnamon</li><li>In a large mixing bowl, beat the eggs. Add the milk, brown sugar and nutmeg; stir well to combine.</li><li>Soak bread slices in the egg mixture until saturated.</li><li>Heat a lightly oiled griddle or frying pan over medium high heat. Brown slices on both sides, sprinkle with cinnamon and serve hot.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). tablespoons a large bowl. over medium heat. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c).</li></ul>", "ttl": "French Toast II"}, "8350": {"actual": "<ul><li>15 graham crackers, crushed</li><li>2 tablespoons butter, melted</li><li>4 (8 ounce) packages cream cheese</li><li>1 1/2 cups white sugar</li><li>3/4 cup milk</li><li>4 eggs</li><li>1 cup sour cream</li><li>1 tablespoon vanilla extract</li><li>1/4 cup all-purpose flour</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch springform pan.</li><li>In a medium bowl, mix graham cracker crumbs with melted butter. Press onto bottom of springform pan.</li><li>In a large bowl, mix cream cheese with sugar until smooth. Blend in milk, and then mix in the eggs one at a time, mixing just enough to incorporate. Mix in sour cream, vanilla and flour until smooth. Pour filling into prepared crust.</li><li>Bake in preheated oven for 1 hour. Turn the oven off, and let cake cool in oven with the door closed for 5 to 6 hours; this prevents cracking. Chill in refrigerator until serving.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped fresh cup chopped</li></ul>", "ttl": "Chantal's New York Cheesecake"}, "12725": {"actual": "<ul><li>4 (4 ounce) fillets salmon</li><li>1/4 cup peanut oil</li><li>2 tablespoons soy sauce</li><li>2 tablespoons balsamic vinegar</li><li>2 tablespoons thinly sliced green onion</li><li>1 1/2 teaspoons brown sugar</li><li>1 clove garlic, minced</li><li>3/4 teaspoon ground ginger</li><li>1/2 teaspoon crushed red pepper flakes</li><li>1/2 teaspoon sesame oil</li><li>1/8 teaspoon salt</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Whisk together peanut oil, soy sauce, balsamic vinegar, green onions, garlic, brown sugar, ginger, red chile flakes, sesame oil, and salt. Place fish in a glass dish, and pour marinade over all. Cover with plastic wrap, and refrigerate for 4 to 6 hours.</li><li>Preheat barbecue or gas grill.</li><li>Oil the grill rack, and adjust height to 5 inches from coals. Remove salmon from marinade, and place on grill. Grill for 10 minutes per inch of thickness, measured at thickest part, or until fish just flakes when tested with a fork. Turn halfway through cooking.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups add the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should</li></ul>", "ttl": "Grilled Salmon II"}, "24685": {"actual": "<ul><li>3 pounds lean ground beef</li><li>4 ounces blue cheese, crumbled</li><li>1/2 cup minced fresh chives</li><li>1/4 teaspoon hot pepper sauce</li><li>1 teaspoon Worcestershire sauce</li><li>1 teaspoon coarsely ground black pepper</li><li>1 1/2 teaspoons salt</li><li>1 teaspoon dry mustard</li><li>12 French rolls or hamburger buns</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a large bowl, mix the ground beef, blue cheese, chives, hot pepper sauce, Worcestershire sauce, black pepper, salt, and mustard. Cover, and refrigerate for 2 hours.</li><li>Preheat grill for high heat. Gently form the burger mixture into about 12 patties.</li><li>Oil the grill grate. Grill patties 5 minutes per side, or until well done. Serve on rolls.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the</li></ul>", "ttl": "Blue Cheese Burgers"}, "31972": {"actual": "<ul><li>1 (4 pound) whole duck, dressed</li><li>1/2 teaspoon ground cinnamon</li><li>1/2 teaspoon ground ginger</li><li>1/4 teaspoon ground nutmeg</li><li>1/4 teaspoon ground white pepper</li><li>1/8 teaspoon ground cloves</li><li>3 tablespoons soy sauce</li><li>1 tablespoon honey</li><li>1 orange, sliced in rounds</li><li>1 tablespoon chopped fresh parsley, for garnish</li><li>5 green onions</li><li>1/2 cup plum jam</li><li>1 1/2 teaspoons sugar</li><li>1 1/2 teaspoons distilled white vinegar</li><li>1/4 cup finely chopped chutney</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.</li><li>Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.</li><li>Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.</li><li>Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.</li><li>Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping.</li><li></li></ul>", "rnn": "<ul><li>4 teaspoon ground black pepper to taste</li><li>1 tablespoon dried cup chopped fresh into the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken</li></ul>", "ttl": "Peking Duck"}, "8722": {"actual": "<ul><li>6 skinless, boneless chicken breast halves</li><li>1 (20 ounce) jar salsa</li><li>1 large red bell pepper, chopped</li><li>2 tablespoons ground cumin</li><li>2 tablespoons lemon juice</li><li>2 tablespoons chili powder</li><li>3 cloves crushed garlic</li><li>2 (15 ounce) cans black beans, rinsed and drained</li><li>Preheat oven to 400 degrees F (205 degrees C).</li><li>Arrange the chicken pieces in a 3 quart casserole dish or a 9x13 inch baking dish. Combine the salsa, red bell pepper, cumin, lemon juice, chili powder and garlic. Pour the mixture over the chicken. Pour the black beans on top and cover. Bake in the preheated oven for 1 to 1 1/2 hours. Serve with rice if desired.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to taste</li><li>1 tablespoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup chopped fresh tablespoons teaspoon dried cup</li></ul>", "ttl": "Mexican Chicken I"}, "32057": {"actual": "<ul><li>2 tablespoons vegetable oil</li><li>1/2 pound boneless skinless chicken breasts, cut into cubes</li><li>2 cloves garlic, chopped</li><li>2 tablespoons oyster sauce</li><li>1 cup chopped broccoli</li><li>1 cup sliced green bell pepper</li><li>1 cup sliced carrots</li><li>1 cup sliced napa cabbage</li><li>1 cup sliced celery</li><li>1 cup fresh bean sprouts</li><li>1 cup sliced zucchini</li><li>1 cup chopped green onions</li><li>1 teaspoon salt</li><li>1/2 cup water</li><li>2 tablespoons mushroom soy sauce</li><li>1 tablespoon cornstarch</li><li>Heat oil in a wok or large heavy skillet. Add chicken or pork (see Cook's Note), garlic, and oyster sauce, and stir-fry for 10 minutes.</li><li>Stir in broccoli, green pepper, carrots, cabbage, celery, bean sprouts, zucchini, and green onions. Season with salt, and stir-fry for 6 to 8 minutes.</li><li>In a small bowl, mix together water, soy sauce and cornstarch. Stir into vegetables, and cook for 1 to 2 minutes, or until sauce is thickened.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in</li></ul>", "ttl": "Stir-Fried Vegetables with Chicken or Pork"}, "15720": {"actual": "<ul><li>1 egg white</li><li>1 teaspoon cold water</li><li>4 cups whole almonds</li><li>1/2 cup white sugar</li><li>1/4 teaspoon salt</li><li>1/2 teaspoon ground cinnamon</li><li>Preheat oven to 250 degrees F (120 degrees C). Lightly grease a 10x15 inch jellyroll pan.</li><li>Lightly beat the egg white; add water, and beat until frothy but not stiff. Add the nuts, and stir until well coated. Mix the sugar, salt, and cinnamon, and sprinkle over the nuts. Toss to coat, and spread evenly on the prepared pan.</li><li>Bake for 1 hour in the preheated oven, stirring occasionally, until golden. Allow to cool, then store nuts in airtight containers.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Cinnamon-Roasted Almonds"}, "16338": {"actual": "<ul><li>2 cups fresh cranberries</li><li>2 oranges, peeled and seeded</li><li>1 carrot, peeled and sliced</li><li>1 cup pecans</li><li>3/4 cup white sugar</li><li>1 (8 ounce) can crushed pineapple, drained</li><li>2 (3 ounce) packages raspberry flavored Jell-O® mix</li><li>1 cup boiling water</li><li>1 cup cold water</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In an electric food processor or meat grinder, grind cranberries, oranges, carrot, and pecans. Pour mixture into a large mixing bowl.</li><li>In a separate bowl, combine sugar, pineapple, gelatin and both cups of water. Mix the ingredients from the two bowls together. Pour the entire mixture into a mold and chill overnight before serving.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Cranberry Salad IV"}, "9036": {"actual": "<ul><li>2 cups chopped, cooked chicken meat</li><li>2 cups fresh chopped broccoli</li><li>1/2 cup chopped onion</li><li>1/2 cup chopped green bell pepper</li><li>1 1/2 cups shredded Cheddar cheese</li><li>1/2 cup mayonnaise</li><li>2 tablespoons Dijon-style prepared mustard</li><li>salt and pepper to taste</li><li>1 tablespoon minced garlic</li><li>1 (8 ounce) package refrigerated crescent rolls</li><li>In a large bowl, combine the chicken, broccoli, onions, bell pepper, cheese, mayonnaise, mustard, salt, pepper and garlic. Mix all together.</li><li>Preheat oven to 400 degrees F (200 degrees C).</li><li>Cover a cookie sheet with aluminum foil. Place a glass upside down in the center of the cookie sheet. Roll out crescent rolls around the base of the glass, with pointy ends away from the glass; when you're finished, the arrangement will look like the sun. Spoon some of the chicken mixture onto the thick part of each crescent roll. Fold the pointy end of each roll over the top of the mixture and tuck in the middle. Remove glass from cookie sheet. Arrangement of rolls will now look like a fluted tube cake.</li><li>Bake in preheated oven for 25 to 30 minutes, or until rolls are golden brown.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the chicken and stir in the chicken breasts in the center and the</li></ul>", "ttl": "Broccoli Chicken Roli"}, "48156": {"actual": "<ul><li>2 large tomatoes, coarsely chopped</li><li>1/2 sweet onion, chopped</li><li>2 tablespoons olive oil</li><li>1 tablespoon chopped fresh oregano</li><li>1 teaspoon chopped fresh basil</li><li>2 teaspoons chopped fresh parsley</li><li>1/2 (1 pound) loaf Italian bread, cut into 1 inch slices</li><li>1/4 cup freshly grated Parmesan cheese</li><li>Preheat oven to 400 degrees F (200 degrees C).</li><li>In a medium bowl, combine tomatoes, onion, olive oil, oregano, basil and parsley. Place bread on a baking sheet, and top with tomato mixture. Sprinkle with Parmesan.</li><li>Bake in preheated oven for 8 to 10 minutes, or until bottom of bread is browned. Allow to cool 5 minutes before serving.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. an instant-read thermometer inserted into the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Ali's Amazing Bruschetta"}, "6925": {"actual": "<ul><li>3 (10 ounce) packages refrigerated biscuit dough</li><li>3/4 cup white sugar</li><li>3 tablespoons ground cinnamon</li><li>1/2 cup margarine</li><li>3/4 cup white sugar</li><li>Mix together 3/4 cup sugar and cinnamon.</li><li>Quarter the biscuits with kitchen shears. Dip shears in water after each cut to keep the biscuits from getting too sticky. Dip biscuits into sugar mixture, and place in a greased tube pan. Do this until all biscuits are used.</li><li>Melt butter or margarine, and mix in 3/4 cup sugar. Pour mixture over biscuits.</li><li>Bake in a preheated 350 degree F (175 degrees C) oven for 30 to 35 minutes.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in the chicken and pepper to taste</li><li>1 tablespoon of the chicken breasts in</li></ul>", "ttl": "Monkey Bread V"}, "15641": {"actual": "<ul><li>2 tablespoons chopped Italian flat leaf parsley</li><li>2 teaspoons fresh rosemary, minced</li><li>2 teaspoons chopped fresh thyme</li><li>1 teaspoon dried sage</li><li>3 cloves garlic, minced</li><li>1/4 cup olive oil</li><li>1/2 cup balsamic vinegar</li><li>salt and pepper to taste</li><li>1 1/2 pounds skinless, boneless chicken breasts</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a blender combine the parsley, rosemary, thyme, sage, garlic, oil, vinegar and salt and pepper to taste. Blend together. Place chicken in a nonporous glass dish or bowl and pour blended marinade over the chicken. Cover dish and refrigerate to marinate for at least 2 hours or up to 48 hours.</li><li>Preheat grill to medium high heat OR set oven to broil.</li><li>Remove chicken from dish (disposing of leftover marinade) and grill or broil for about 6 to 7 minutes per side, or until chicken is cooked through and no longer pink inside.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Grilled Chicken with Herbs"}, "7151": {"actual": "<ul><li>2 1/4 cups all-purpose flour</li><li>3/4 cup packed brown sugar</li><li>1 tablespoon baking powder</li><li>1 teaspoon salt</li><li>1/4 cup margarine, softened</li><li>2 eggs</li><li>2 tablespoons orange zest</li><li>1/2 cup milk</li><li>1/2 cup orange juice</li><li>1 cup fresh blueberries</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C). Lightly grease the bottom of one 5x9 inch loaf pan.</li><li>In a large bowl combine the flour, brown sugar, baking powder, salt, butter, egg, orange zest, milk and orange juice. Beat at low speed just until moistened. Then beat at medium speed for 2 minutes. Fold in the blueberries and spread into the prepared pan.</li><li>Bake at 350 degrees F (175 degrees C) for 60 to 70 minutes or until a toothpick poked into the center of the loaf comes out clean. Cool in pan for 10 minutes then invert onto a wire rack to cool completely before serving.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. an instant-read thermometer inserted into the center should read at least 165 degrees f (74 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until</li></ul>", "ttl": "Blueberry Orange Bread"}, "44172": {"actual": "<ul><li>1 1/2 pounds ground beef</li><li>1 tablespoon Worcestershire sauce</li><li>1 (4 ounce) can tomato sauce</li><li>1/3 cup crushed fried pork skins</li><li>2 eggs</li><li>2 1/2 tablespoons chili powder</li><li>1 tablespoon garlic salt</li><li>1 tablespoon garlic pepper seasoning</li><li>Preheat the oven to 375 degrees F (190 degrees C).</li><li>In a large bowl, mix together the ground beef, Worcestershire sauce. tomato sauce, crushed pork skins, and eggs. Season with chili powder, garlic salt, and garlic pepper. Mix until well blended. Form into a loaf, and place into a greased loaf pan.</li><li>Bake, uncovered for 35 to 40 minutes in the preheated oven. Let stand for at least 5 minutes before slicing and serving.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "All Protein Meatloaf"}, "24922": {"actual": "<ul><li>1/3 cup butter</li><li>1 teaspoon prepared Dijon-style mustard</li><li>1 tablespoon chopped fresh rosemary</li><li>2 tablespoons chopped fresh basil leaves</li><li>2 drops hot pepper sauce</li><li>1 (12 ounce) package refrigerated biscuit dough</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 400 degrees F (200 degrees C). Lightly grease a medium baking sheet.</li><li>In a medium saucepan over medium heat, melt butter and mix with Dijon-style mustard, rosemary, basil and hot pepper sauce.</li><li>Dip biscuit dough piece by piece into the butter mixture, and arrange pieces on the prepared baking sheet.</li><li>Bake in the preheated oven 15 to 20 minutes, or until golden brown.</li><li></li></ul>", "rnn": "<ul><li>1 cup of the mixture to the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the preheated oven until the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the</li></ul>", "ttl": "Herb Biscuits"}, "14786": {"actual": "<ul><li>16 large headless shrimp</li><li>8 slices bacon</li><li>barbeque seasoning, to taste</li><li>Clean and devein the shrimp, leaving the last section of the tail. Wrap with 1/2 slice of bacon, securing with a toothpick. Be sure and use the large shrimp; the cooking time for the shrimp and the bacon is similar. If you do use mediums, you might want to precook the bacon a little--over cooked shrimp are tough and rubbery, and a real sin!</li><li>Line a jellyroll pan (15x18x1 inch baking pan) with aluminum foil and place baking rack in pan. Place the shrimp on the rack, and sprinkle with barbecue seasoning to taste; turn and sprinkle second side. Set aside for 15 to 20 minutes while the oven preheats. The bacon will turn from creamy white to a little opaque, and the seasoning will soak in.</li><li>Preheat oven to 450 degrees F (230 degrees C).</li><li>Bake wrapped shrimp in preheated oven for 10 to 15 minutes. The bacon should be crisp, and the shrimp pink and tender. The rack keeps the shrimp from sitting in the draining bacon fat.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups fresh cup of the mixture to the chicken and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at least 165 degrees f (175 degrees c). to a boil and stir in the chicken breasts in the center should read at</li></ul>", "ttl": "Bacon Wrapped Barbeque Shrimp"}, "15093": {"actual": "<ul><li>1 cup white sugar</li><li>2 tablespoons all-purpose flour</li><li>3 tablespoons cornstarch</li><li>1/4 teaspoon salt</li><li>1 1/2 cups water</li><li>2 lemons, juiced and zested</li><li>2 tablespoons butter</li><li>4 egg yolks, beaten</li><li>1 (9 inch) pie crust, baked</li><li>4 egg whites</li><li>6 tablespoons white sugar</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>To Make Lemon Filling: In a medium saucepan, whisk together 1 cup sugar, flour, cornstarch, and salt. Stir in water, lemon juice and lemon zest. Cook over medium-high heat, stirring frequently, until mixture comes to a boil. Stir in butter. Place egg yolks in a small bowl and gradually whisk in 1/2 cup of hot sugar mixture. Whisk egg yolk mixture back into remaining sugar mixture. Bring to a boil and continue to cook while stirring constantly until thick. Remove from heat. Pour filling into baked pastry shell.</li><li>To Make Meringue: In a large glass or metal bowl, whip egg whites until foamy. Add sugar gradually, and continue to whip until stiff peaks form. Spread meringue over pie, sealing the edges at the crust.</li><li>Bake in preheated oven for 10 minutes, or until meringue is golden brown.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in a large bowl. to a boil and stir in the chicken breasts in the center and the</li></ul>", "ttl": "Grandma's Lemon Meringue Pie"}, "15861": {"actual": "<ul><li>1 cup shredded Cheddar cheese</li><li>1/2 cup cooked, cubed chicken meat</li><li>1/2 cup frozen zucchini, cooked</li><li>3 eggs</li><li>1/2 cup baking mix</li><li>1/2 teaspoon salt</li><li>1 dash garlic powder</li><li>1 tablespoon dried minced onion</li><li>2 tablespoons chopped fresh parsley</li><li>1 1/2 cups milk</li><li>1/3 cup olive oil</li><li>1/2 teaspoon paprika</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C). Generously grease a 9-inch pie pan.</li><li>Spread shredded cheese across bottom of pie pan. Cover cheese with meat and vegetables.</li><li>In a blender, combine eggs, baking mix, salt, garlic powder, onions, parsley, and milk. Blend until smooth, then add olive oil. Blend until combined, then pour mixture over meat and vegetable layer. Sprinkle with paprika.</li><li>Bake in preheated oven for 40 minutes. Cool 10 minutes before serving.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the preheated oven to the onion and garlic in the chicken breasts in the</li></ul>", "ttl": "Easy and Delicious Blender Quiche"}, "35361": {"actual": "<ul><li>1 tablespoon butter</li><li>18 slices bacon</li><li>1 1/2 pounds baking potatoes, peeled and sliced</li><li>1 1/4 cups shredded fontina cheese</li><li>salt and pepper to taste</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 400 degrees F (200 degrees C).</li><li>Coat an 8 inch round baking dish with the butter. Arrange bacon in a spiral fashion in the baking dish, draping ends of the slices over the pan edge to fold over filling.</li><li>Arrange 1/3 of the potatoes over bacon, and sprinkle with 1/3 Fontina cheese. Repeat layers with remaining potatoes and cheese, and season with salt and pepper. Fold bacon over filling to form the upper layer.</li><li>Bake uncovered in the preheated oven 1 hour, or until potatoes are tender. Drain any drippings, and cut into wedges to serve.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and</li></ul>", "ttl": "Bacon, Potato and Cheese Tart"}, "27739": {"actual": "<ul><li>2 (14 ounce) cans coconut milk</li><li>2 tablespoons green curry paste</li><li>2/3 cup chicken broth</li><li>1 (8 ounce) can sliced water chestnuts, drained</li><li>1 (8 ounce) can sliced bamboo shoots, drained</li><li>1 green bell pepper, cut into 1 inch pieces</li><li>1 cup sliced fresh mushrooms</li><li>3 boneless skinless chicken breasts, cut into 1 inch pieces</li><li>3 tablespoons fish sauce</li><li>1/4 cup chopped fresh basil</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Over medium heat, whisk coconut milk and curry paste together in a large saucepan. Simmer for 5 minutes.</li><li>Stir in chicken broth, water chestnuts, bamboo shoots, bell pepper, mushrooms, and chicken. Season with fish sauce and basil. Simmer for 10 more minutes, or until chicken is cooked, yet still tender.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups fresh tablespoons to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a</li></ul>", "ttl": "Ken's Spicy Curry Chicken"}, "18280": {"actual": "<ul><li>1 1/2 pounds new potatoes, cut into wedges</li><li>4 tablespoons butter</li><li>2 teaspoons fresh rosemary</li><li>salt and pepper to taste</li><li>Preheat oven to 450 degrees F (230 degrees C).</li><li>In a hot skillet, melt the butter. Stir in rosemary, salt and pepper. Coat potatoes evenly with the melted butter. Arrange the potatoes in a single layer on a baking pan.</li><li>Bake in a preheated oven until potatoes are golden brown, approximately 20 to 25 minutes. Toss them occasionally to ensure that they brown on all sides.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Early Morning Oven Roasted New Potatoes"}, "25794": {"actual": "<ul><li>3 cups quick-cooking oats</li><li>1 (14 ounce) can sweetened condensed milk</li><li>2 tablespoons butter, melted</li><li>1 cup flaked coconut</li><li>1 cup sliced almonds</li><li>1 cup miniature semisweet chocolate chips</li><li>1/2 cup sweetened dried cranberries</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.</li><li>In a large bowl, mix together the oats, sweetened condensed milk, butter, coconut, almonds, chocolate chips and cranberries with your hands until well blended. Press flat into the prepared pan.</li><li>Bake for 20 to 25 minutes in the preheated oven, depending on how crunchy you want them. Lightly browned just around the edges will give you moist, chewy bars. Let cool for 5 minutes, cut into squares then let cool completely before serving.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon olive oil in a large bowl. over the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center</li></ul>", "ttl": "Easy Granola Bars"}, "14316": {"actual": "<ul><li>2 skinless, boneless chicken breast halves</li><li>1 (1.27 ounce) packet dry fajita seasoning, divided</li><li>1 tablespoon vegetable oil</li><li>1 (15 ounce) can black beans, rinsed and drained</li><li>1 (11 ounce) can Mexican-style corn</li><li>1/2 cup salsa</li><li>1 (10 ounce) package mixed salad greens</li><li>1 onion, chopped</li><li>1 tomato, cut into wedges</li><li>Rub chicken evenly with 1/2 the fajita seasoning. Heat the oil in a skillet over medium heat, and cook the chicken 8 minutes on each side, or until juices run clear; set aside.</li><li>In a large saucepan, mix beans, corn, salsa and other 1/2 of fajita seasoning. Heat over medium heat until warm.</li><li>Prepare the salad by tossing the greens, onion and tomato. Top salad with chicken and dress with the bean and corn mixture.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large</li></ul>", "ttl": "Chicken Fiesta Salad"}, "16421": {"actual": "<ul><li>16 ounces Italian bread</li><li>2 tablespoons olive oil</li><li>1 (16 ounce) jar marinated roasted sweet red peppers</li><li>3 cloves garlic, chopped</li><li>1 tomato, seeded and chopped</li><li>1 cup chopped fresh basil</li><li>1 onion, chopped (optional)</li><li>3 teaspoons balsamic vinegar</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat your oven's broiler.</li><li>Slice bread loaf into 1-inch thick portions. Brush each slice on one side with olive oil. Broil, oil-side up, until barely golden. Remove from broiler pan and cool.</li><li>In a medium bowl, mix together roasted pepper, garlic, tomato, basil, and onion. Sprinkle mixture evenly on each toast portion. Drizzle with balsamic vinegar. Serve immediately.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the onion and garlic in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the</li></ul>", "ttl": "Bruschetta with Roasted Sweet Red Peppers"}, "12816": {"actual": "<ul><li>3/4 cup butter</li><li>2 onions, chopped</li><li>2 cloves garlic, minced</li><li>1 bunch fresh parsley, chopped</li><li>2 (14.5 ounce) cans stewed tomatoes</li><li>2 (14.5 ounce) cans chicken broth</li><li>2 bay leaves</li><li>1 tablespoon dried basil</li><li>1/2 teaspoon dried thyme</li><li>1/2 teaspoon dried oregano</li><li>1 cup water</li><li>1 1/2 cups white wine</li><li>1 1/2 pounds large shrimp - peeled and deveined</li><li>1 1/2 pounds bay scallops</li><li>18 small clams</li><li>18 mussels, cleaned and debearded</li><li>1 1/2 cups crabmeat</li><li>1 1/2 pounds cod fillets, cubed</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Over medium-low heat melt butter in a large stockpot, add onions, garlic and parsley. Cook slowly, stirring occasionally until onions are soft.</li><li>Add tomatoes to the pot (break them into chunks as you add them). Add chicken broth, bay leaves, basil, thyme, oregano, water and wine. Mix well. Cover and simmer 30 minutes.</li><li>Stir in the shrimp, scallops, clams, mussels and crabmeat. Stir in fish, if desired. Bring to boil. Lower heat, cover and simmer 5 to 7 minutes until clams open. Ladle soup into bowls and serve with warm, crusty bread!</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Cioppino"}, "12223": {"actual": "<ul><li>2 eggs</li><li>1/2 cup white sugar</li><li>1/2 cup packed brown sugar</li><li>1 tablespoon all-purpose flour</li><li>1 teaspoon ground cinnamon</li><li>1/4 teaspoon ground nutmeg</li><li>1/4 teaspoon ground ginger</li><li>1/2 teaspoon salt</li><li>2 cups solid pack pumpkin puree</li><li>1 (14 ounce) can sweetened condensed milk</li><li>2 tablespoons butter</li><li>1 tablespoon orange zest</li><li>1/4 cup packed brown sugar</li><li>3/4 cup pecan halves</li><li>Combine eggs, sugars, flour, spices and salt. Blend in pumpkin. Gradually add milk; mix well.</li><li>Pour into 9-inch pie shell. Bake in 450 degree F (230 degrees C) oven 10 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake 40 to 50 minutes longer.</li><li>Sprinkle pecan mixture over pie the last 10 minutes before removing from the oven.</li><li>To Make Topping: Combine 2 tablespoons butter, 1 tablespoon grated orange rind, 1/4 cup brown sugar and 3/4 cup whole pecans.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Pecan Pumpkin Pie I"}, "15810": {"actual": "<ul><li>2 cups all-purpose flour</li><li>2 teaspoons baking soda</li><li>1 teaspoon baking powder</li><li>1 teaspoon salt</li><li>2 teaspoons ground cinnamon</li><li>1 3/4 cups white sugar</li><li>1 cup vegetable oil</li><li>3 eggs</li><li>1 teaspoon vanilla extract</li><li>2 cups shredded carrots</li><li>1 cup flaked coconut</li><li>1 cup chopped walnuts</li><li>1 (8 ounce) can crushed pineapple, drained</li><li>1 (8 ounce) package cream cheese</li><li>1/4 cup butter, softened</li><li>2 cups confectioners' sugar</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.</li><li>Mix flour, baking soda, baking powder, salt and cinnamon. Make a well in the center and add sugar, oil, eggs and vanilla. Mix with wooden spoon until smooth. Stir in carrots, coconut, walnuts and pineapple.</li><li>Pour into 9x13 inch pan. Bake at 350 degrees for about 45 minutes. Don't panic, the center will sink a little. Allow to cool.</li><li>To make the frosting: Cream the butter and cream cheese until smooth. Add the confectioners sugar and beat until creamy.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and</li></ul>", "ttl": "Carrot Pineapple Cake I"}, "15142": {"actual": "<ul><li>3/4 cup all-purpose flour</li><li>1/2 teaspoon salt</li><li>1 teaspoon baking powder</li><li>1 (3 ounce) package non-instant vanilla pudding mix</li><li>3 tablespoons butter, softened</li><li>1 egg</li><li>1/2 cup milk</li><li>1 (29 ounce) can sliced peaches, drained and syrup reserved</li><li>1 (8 ounce) package cream cheese, softened</li><li>1/2 cup white sugar</li><li>1 tablespoon white sugar</li><li>1 teaspoon ground cinnamon</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease sides and bottom of a 10 inch deep-dish pie pan.</li><li>In a medium mixing bowl, mix together flour, salt, baking powder and pudding mix. Mix in butter, egg and milk. Beat for 2 minutes. Pour mixture into pie pan. Arrange the peach slices on top of the pudding mixture.</li><li>In a small mixing bowl, beat cream cheese until fluffy. Add 1/2 cup sugar and 3 tablespoons reserved peach syrup. Beat for 2 minutes. Spoon mixture over peaches to within 1 inch of pan edge. Mix together 1 tablespoon sugar and 1 teaspoon cinnamon, and sprinkle over top.</li><li>Bake in preheated oven for 30 to 35 minutes, until golden brown. Chill before serving.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken</li></ul>", "ttl": "Award Winning Peaches and Cream Pie"}, "23735": {"actual": "<ul><li>3 skinless, boneless chicken breast halves - cooked and cubed</li><li>2 tablespoons butter, melted</li><li>1 (2 ounce) bottle hot sauce</li><li>1 (8 ounce) bottle blue cheese salad dressing</li><li>1 (16 inch) prepared pizza crust</li><li>1 (8 ounce) package shredded mozzarella cheese</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 425 degrees F (220 degrees C).</li><li>In a medium bowl combine the cubed chicken, melted butter and hot sauce. Mix well. Spread whole bottle of salad dressing over crust, then top with chicken mixture and sprinkle with shredded cheese.</li><li>Bake in preheated oven until crust is golden brown and cheese is bubbly, about 5 to 10 minutes. Let set a few minutes before slicing, and serve.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. season with the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165</li></ul>", "ttl": "Buffalo Style Chicken Pizza"}, "10275": {"actual": "<ul><li>1 cup unsalted butter</li><li>1 cup crunchy peanut butter</li><li>1 cup white sugar</li><li>1 cup packed brown sugar</li><li>2 eggs</li><li>2 1/2 cups all-purpose flour</li><li>1 teaspoon baking powder</li><li>1/2 teaspoon salt</li><li>1 1/2 teaspoons baking soda</li><li>Cream butter, peanut butter, and sugars together in a bowl; beat in eggs.</li><li>In a separate bowl, sift flour, baking powder, baking soda, and salt; stir into butter mixture. Put dough in refrigerator for 1 hour.</li><li>Roll dough into 1 inch balls and put on baking sheets. Flatten each ball with a fork, making a crisscross pattern. Bake in a preheated 375 degrees F oven for about 10 minutes or until cookies begin to brown.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir in the chicken and stir</li></ul>", "ttl": "Classic Peanut Butter Cookies"}, "46609": {"actual": "<ul><li>2 pounds fresh green beans, trimmed</li><li>3 tablespoons unsalted butter</li><li>1 large red onion, quartered and thinly sliced</li><li>2 cloves garlic, peeled and minced</li><li>1 1/2 teaspoons red wine vinegar</li><li>3 tablespoons chicken broth</li><li>salt and pepper to taste</li><li>3 tablespoons finely chopped cilantro</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Bring a large pot of lightly salted water to boil. Place green beans in the water, and cook about 3 minutes. Remove from heat, and drain in a colander. Place under cold water until no longer hot. Drain, and pat dry.</li><li>Melt 1 tablespoon butter in a medium skillet over medium heat. Stir in the onion and garlic, and saute until onion is tender. Melt remaining butter in the skillet, and mix in the green beans. Stir in the vinegar and broth. Season with salt and pepper. Mix in cilantro. Cover, reduce heat, and simmer 15 minutes, or until green beans are tender.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon ground black pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1 tablespoon dried and pepper to taste</li><li>1</li></ul>", "ttl": "Georgian Green Beans"}, "17108": {"actual": "<ul><li>1 (4 pound) whole chicken, cut into pieces</li><li>6 cloves garlic, chopped</li><li>4 tablespoons oyster sauce</li><li>2 tablespoons curry powder</li><li>1/2 cup vegetable oil</li><li>To Marinate: In a nonporous glass dish or bowl, combine the garlic, oyster sauce and curry powder. Mix together. Add chicken pieces and turn to coat. Cover dish or bowl and refrigerate to marinate for at least 1/2 hour.</li><li>In a large skillet or wok, heat oil over medium high heat. Add marinated chicken (disposing of leftover marinade) and fry for 20 to 25 minutes or until chicken is crispy and brown and juices run clear.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken</li></ul>", "ttl": "Simple Malaysian Fried Chicken"}, "21256": {"actual": "<ul><li>1/4 cup fine dry bread crumbs</li><li>2 tablespoons grated Parmesan cheese</li><li>1 tablespoon cornmeal</li><li>1 teaspoon olive oil</li><li>1/2 teaspoon Italian seasoning</li><li>1/8 teaspoon garlic powder</li><li>1/8 teaspoon ground black pepper</li><li>4 (3 ounce) fillets cod fillets</li><li>1 egg white, lightly beaten</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 450 degrees F (230 degrees C).</li><li>In a small shallow bowl, stir together the bread crumbs, cheese, cornmeal, oil, italian seasoning, garlic powder and pepper; set aside.</li><li>Coat the rack of a broiling pan with cooking spray. Place the cod on the rack, folding under any thin edges of the filets. Brush with the egg white, then spoon the crumb mixture evenly on top.</li><li>Bake in a preheated oven for 10 to 12 minutes or until the fish flakes easily when tested with a fork and is opaque all the way through.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read</li></ul>", "ttl": "Cod with Italian Crumb Topping"}, "27188": {"actual": "<ul><li>2 eggs</li><li>1 cup milk</li><li>2/3 cup all-purpose flour</li><li>1 pinch salt</li><li>1 1/2 teaspoons vegetable oil</li><li>In a blender combine eggs, milk, flour, salt and oil. Process until smooth. Cover and refrigerate 1 hour.</li><li>Heat a skillet over medium-high heat and brush with oil. Pour 1/4 cup of crepe batter into pan, tilting to completely coat the surface of the pan. Cook 2 to 5 minutes, turning once, until golden. Repeat with remaining batter.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. over the pork and the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees</li></ul>", "ttl": "Crepes"}, "17743": {"actual": "<ul><li>1 ready made pizza crust</li><li>2 cups shredded mozzarella cheese</li><li>1 cup tomato sauce</li><li>1/2 cup chopped green bell pepper</li><li>1/2 cup fresh sliced mushrooms</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat an outdoor grill for high heat and lightly oil grate.</li><li>Roll out prepared pizza dough to a size that will fit your grill. Place on grill for 5 minutes, or to desired doneness, and flip over. Now add the sauce, cheese, green bell pepper and mushrooms.</li><li>Cover the grill and allow to cook over high heat for 5 to 10 minutes, or until cheese is melted and bubbly.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center should read at least 165 degrees f (74 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Pizza On The Grill II"}, "14155": {"actual": "<ul><li>4 large tomatoes</li><li>4 tablespoons olive oil</li><li>ground black pepper to taste</li><li>10 ounces mozzarella cheese, thickly sliced</li><li>8 leaves fresh basil, torn into strips</li><li>Chop tomatoes in half, then slice finely; arrange on four plates. Trickle a tablespoon of olive oil over each serving, and sprinkle with black pepper. Lay slices of cheese over tomatoes, and strips of basil over cheese. Cover with plastic wrap, and refrigerate for 30 minutes before serving.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the hot oil in a large skillet over the tomato and stir in the center and the chicken and stir in the</li></ul>", "ttl": "Owen's Mozzarella and Tomato Salad"}, "12751": {"actual": "<ul><li>1 pound fresh mushrooms</li><li>7 ounces crabmeat</li><li>5 green onions, thinly sliced</li><li>1/4 teaspoon dried thyme</li><li>1/4 teaspoon dried oregano</li><li>1/4 teaspoon ground savory</li><li>ground black pepper to taste</li><li>1/4 cup grated Parmesan cheese</li><li>1/3 cup mayonnaise</li><li>3 tablespoons grated Parmesan cheese</li><li>1/4 teaspoon paprika</li><li>Preheat the oven to 350 degrees F (175 degrees C).</li><li>In a medium bowl, combine crabmeat, green onions, herbs, and pepper. Mix in mayonnaise and 1/4 cup Parmesan cheese until well combined. Refrigerate filling until ready for use.</li><li>Wipe the mushrooms clean with a damp towel. Remove stems. Spoon out the gills and the base of the stem, making deep cups. Discard gills and stems. Fill the mushroom caps with rounded teaspoonfuls of filling, and place them in an ungreased shallow baking dish. Sprinkle tops with Parmesan and paprika.</li><li>Bake for 15 minutes. Remove from oven, and serve immediately</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to the chicken breasts in the preheated oven to</li></ul>", "ttl": "Crab Stuffed Mushrooms"}, "22768": {"actual": "<ul><li>1 (20 ounce) can pineapple chunks - drained with juice reserved</li><li>1 orange, peeled and segmented</li><li>1 kiwi -- peeled, halved and sliced</li><li>1 cup seedless grapes</li><li>1 cup quartered strawberries</li><li>1/4 teaspoon grated lime zest</li><li>2 tablespoons lime juice</li><li>1 tablespoon honey</li><li>1 teaspoon poppy seeds</li><li>In a large bowl, toss pineapple, orange, kiwi, grapes and strawberries. In a small cup or bowl, combine lime zest, lime juice, honey, poppy seeds and 1/4 cup reserved pineapple juice. Stir well and toss with fruit.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Tangy Poppy Seed Fruit Salad"}, "18442": {"actual": "<ul><li>8 ounces lasagna noodles</li><li>1 pound ground beef</li><li>1/4 cup minced onions</li><li>1 teaspoon salt</li><li>1/2 teaspoon garlic salt</li><li>1 (32 ounce) jar spaghetti sauce</li><li>1 (16 ounce) package large curd cottage cheese</li><li>1 pound mozzarella cheese, shredded</li><li>Bring a large pot of lightly salted water to a boil. Cook noodles in boiling water for 8 to 10 minutes, or until al dente; drain.</li><li>In a large skillet over medium heat, saute ground beef, onions, salt and garlic salt until meat is brown. Drain excess fat, add spaghetti sauce to beef mixture, and bring to a boil. Reduce heat, and simmer for 15 to 20 minutes.</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch glass baking pan.</li><li>Line bottom of pan with three lasagna noodles. Spread 1/3 of sauce mixture over noodles. Layer 1/3 of the cottage cheese over the sauce. Sprinkle 1/3 of the mozzarella over the cottage cheese. Repeat this layering process until all ingredients are used up.</li><li>Bake in the preheated oven for one hour. Let stand for 10 minutes before serving.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees</li></ul>", "ttl": "Bob's Awesome Lasagna"}, "50435": {"actual": "<ul><li>TOPPINGS:</li><li>1 pound ground beef</li><li>1 (1.25 ounce) package taco seasoning mix</li><li>1 (15.5 ounce) can pinto beans, with liquid</li><li>1 cup shredded Cheddar cheese</li><li>2 cups shredded iceberg lettuce</li><li>1/2 cup picante sauce</li><li>FRY BREAD:</li><li>2 cups all-purpose flour</li><li>1 tablespoon baking powder</li><li>1 teaspoon salt</li><li>1 cup milk</li><li>4 cups oil for frying, or as needed</li><li>Combine beans and 2 tablespoons of picante sauce in a small saucepan over low heat. Cook until heated through. In a large skillet, over medium-high heat, cook the ground beef with taco seasoning mix according to seasoning mix package directions. Cover, and keep warm while you prepare the fry bread.</li><li>In a medium bowl, stir together the flour, baking powder, and salt. Stir in milk, and mix until the dough comes together. Add more flour if necessary to be able to handle the dough. On a floured surface, knead the dough until smooth, at least 5 minutes. Let the dough rest for 5 minutes.</li><li>Heat oil in a large, deep heavy skillet to 365 degrees F (180 degrees C). Oil should be about 1 1/2 inches deep. Break off 3/4 cup sized pieces of dough, and shape into round discs 1/4 inch in thickness, making a thinner depressed area in the center. Fry breads in the hot oil until golden on both sides, turning only once. Drain on paper towels.</li><li>Top fry bread with beans, ground beef, lettuce and cheese. Spoon picante sauce over. You can also top with other of your favorite taco toppings, such as onion, sour cream or guacamole.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees</li></ul>", "ttl": "Fry Bread Tacos II"}, "7471": {"actual": "<ul><li>1 cup butter, softened</li><li>1 1/4 cups white sugar</li><li>1 1/2 teaspoons vanilla extract</li><li>3 cups all-purpose flour</li><li>1 tablespoon baking powder</li><li>1/2 teaspoon salt</li><li>1 cup milk</li><li>6 egg whites</li><li>1/2 cup white sugar</li><li>1 recipe Lady Baltimore Frosting</li><li>1/2 cup raisins, coarsely chopped</li><li>1/3 cup chopped pecans</li><li>1/3 cup chopped candied cherries</li><li>2 teaspoons vanilla extract</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round layer pans.</li><li>In a large bowl, cream butter or margarine, 1 1/4 cups sugar and 1 1/2 teaspoons vanilla together well. Beat until light and fluffy.</li><li>Stir flour, baking powder, and salt together in another bowl. Add flour mixture to butter mixture in 3 parts alternating with milk in 2 parts, beginning and ending with flour.</li><li>Using clean beaters, beat egg whites in mixing bowl until soft peaks form. Add 1/2 cup sugar gradually while beating until stiff. Fold whipped egg whites into batter. Pour into prepared pans.</li><li>Bake for 25 to 30 minutes, until an inserted wooden pick comes out clean. Cool.</li><li>To Make Filling: Stir 2 cups Lady Baltimore Frosting, raisins, nuts, cherries, and 2 teaspoons vanilla or sherry all together. Use as filling to spread between layers. Spread remaining frosting on tops and sides of cake.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1 tablespoon olive oil in a large bowl. over the butter and stir in the center and the chicken and pepper to taste</li><li>1</li></ul>", "ttl": "Lady Baltimore Cake"}, "8524": {"actual": "<ul><li>3 tablespoons olive oil</li><li>1 tablespoon minced onion</li><li>1 clove crushed garlic</li><li>1 teaspoon dried thyme</li><li>1/2 teaspoon dried rosemary, crushed</li><li>1/4 teaspoon ground sage</li><li>1/4 teaspoon dried marjoram</li><li>1/2 teaspoon salt</li><li>1/2 teaspoon ground black pepper</li><li>1/8 teaspoon hot pepper sauce</li><li>4 bone-in chicken breast halves, with skin</li><li>1 1/2 tablespoons chopped fresh parsley</li><li>Preheat oven to 425 degrees F (220 degrees C).</li><li>In a bowl, prepare the basting sauce by combining olive oil, onion, garlic, thyme, rosemary, sage, marjoram, salt, pepper, and hot pepper sauce.</li><li>Turn chicken breasts in sauce to coat thoroughly. Place skin side up in a shallow baking dish. Cover.</li><li>Roast at 425 degrees F (220 degrees C), basting occasionally with pan drippings, for about 35 to 45 minutes. Remove to warm platter, spoon pan juices over, and sprinkle with fresh parsley.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Chicken Breasts with Herb Basting Sauce"}, "17192": {"actual": "<ul><li>2 eggs</li><li>1 cup buttermilk</li><li>1 tablespoon Worcestershire sauce</li><li>1/2 teaspoon vinegar-based hot pepper sauce</li><li>3/4 teaspoon cayenne pepper</li><li>1/4 teaspoon seasoning salt</li><li>1/4 teaspoon garlic powder</li><li>1 cup cornmeal</li><li>2 1/4 cups all-purpose flour</li><li>1 teaspoon salt</li><li>3/4 teaspoon ground black pepper</li><li>1 (32 ounce) jar dill pickle slices</li><li>1 cup vegetable oil for deep frying</li><li>salt and pepper to taste</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a large bowl, combine 2 eggs, 1/4 cup of the flour, buttermilk, Worcestershire sauce, hot sauce, cayenne pepper, seasoning salt and garlic powder.</li><li>In a separate mixing bowl, combine cornmeal, 2 cups flour, salt and 3/4 teaspoon black pepper.</li><li>Preheat oil in a deep fryer or pot to 365 degrees F (180 degrees C).</li><li>Dip drained pickles into milk mixture and then dredge them in the flour mixture. Deep fry until golden brown. Drain on paper towels. Salt and pepper to taste</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon olive oil in a large bowl. to a boil and stir in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees</li></ul>", "ttl": "Deep Fried Dill Pickles"}, "9353": {"actual": "<ul><li>2 cups fresh strawberries</li><li>3 1/8 cups all-purpose flour</li><li>2 cups white sugar</li><li>1 tablespoon ground cinnamon</li><li>1 teaspoon salt</li><li>1 teaspoon baking soda</li><li>1 1/4 cups vegetable oil</li><li>4 eggs, beaten</li><li>1 1/4 cups chopped pecans</li><li>Preheat oven to 350 degrees F (175 degrees C). Butter and flour two 9 x 5-inch loaf pans.</li><li>Slice strawberries and place in medium-sized bowl. Sprinkle lightly with sugar, and set aside while preparing batter.</li><li>Combine flour, sugar, cinnamon, salt and baking soda in large bowl; mix well. Blend oil and eggs into strawberries. Add strawberry mixture to flour mixture, blending until dry ingredients are just moistened. Stir in pecans. Divide batter into pans.</li><li>Bake in preheated oven until a tester inserted in the center comes out clean, 45 to 50 minutes (test each loaf separately). Let cool in pans on wire rack for 10 minutes. Turn loaves out of pans, and allow to cool before slicing.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the onion and garlic in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Strawberry Bread"}, "18897": {"actual": "<ul><li>1 cup couscous</li><li>1 cup boiling water</li><li>3 tablespoons olive oil</li><li>1 clove garlic, minced</li><li>1/4 cup diced red bell pepper</li><li>4 green onions, sliced</li><li>1 cup cherry tomatoes</li><li>1 cup fresh basil leaves</li><li>1 pinch salt</li><li>1 pinch ground black pepper</li><li>1 dash balsamic vinegar</li><li>1/4 cup grated Parmesan cheese</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>Stir couscous into boiling water and return water to a boil. Cover and remove pot from heat. Let stand 5 minutes, then fluff with a fork.</li><li>While the couscous is cooking, heat oil in a large skillet over medium heat. Stir in garlic, green onions and peppers; saute briefly. Stir in tomatoes, basil, cooked couscous, salt and pepper. Mix together and transfer to a 1 1/2 quart casserole dish. Splash some balsamic vinegar on top.</li><li>Bake in a preheated 350 degrees F (175 degrees C) oven for 20 minutes. Sprinkle with Parmesan cheese while still warm.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. an instant-read thermometer inserted into the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in the chicken breasts in</li></ul>", "ttl": "Company Couscous"}, "20703": {"actual": "<ul><li>1/2 (1 pound) loaf white bread, cut into cubes</li><li>1 1/2 pounds Cheddar cheese, shredded</li><li>1 cup cubed cooked ham</li><li>8 eggs</li><li>2 cups milk</li><li>1 pinch salt</li><li>1 dash hot pepper sauce, or to taste</li><li>1/4 cup chopped green onion</li><li>Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.</li><li>Place half of the bread cubes on bottom of baking pan. Sprinkle with half of the ham and then half of the cheese; repeat.</li><li>In a large bowl, beat together eggs, milk, salt, hot sauce and green onions. Pour egg mixture into pan.</li><li>Place pan on top of a baking sheet with a rim and place in oven. Pour water into baking sheet and bake for 60 minutes, or until eggs have set.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read at least 165 degrees f (175 degrees c). the chicken breasts in the center should read</li></ul>", "ttl": "Baked Brunch Omelet"}, "17779": {"actual": "<ul><li>1/4 cup butter</li><li>1/2 pound button mushrooms, chopped</li><li>1/2 teaspoon salt</li><li>1/4 teaspoon ground black pepper</li><li>1/2 teaspoon ground nutmeg</li><li>1 cup seasoned dry bread crumbs, divided</li><li>6 skinless, boneless chicken breast halves</li><li>1/8 cup butter, melted</li><li>3/4 cup heavy cream</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>To Make Mushroom Filling: Melt 1/4 cup butter in a small skillet over medium heat. Add mushrooms, salt and pepper and saute together, stirring, until mushrooms are dark. Remove skillet from heat; stir in nutmeg and 3/4 cup bread crumbs.</li><li>Spoon mushroom mixture onto the end of each chicken breast, roll up and fasten with toothpicks. Place seam side down in a lightly greased 9x13 inch baking dish. Brush 1/8 cup melted butter over breasts, then sprinkle with remaining 1/4 cup bread crumbs. Pour cream over all.</li><li>Bake uncovered at 350 degrees F (175 degrees C) for 30 minutes or until chicken is cooked through and no longer pink.</li><li></li></ul>", "rnn": "<ul><li>1 1/2 cups fresh tablespoons olive oil in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts in a large bowl. over the chicken breasts in the chicken breasts</li></ul>", "ttl": "Mushroom Stuffed Chicken Rollups"}, "15272": {"actual": "<ul><li>6 cups all-purpose flour</li><li>1 tablespoon baking powder</li><li>1 tablespoon ground ginger</li><li>1 teaspoon ground nutmeg</li><li>1 teaspoon ground cloves</li><li>1 teaspoon ground cinnamon</li><li>1 cup shortening, melted and cooled slightly</li><li>1 cup molasses</li><li>1 cup packed brown sugar</li><li>1/2 cup water</li><li>1 egg</li><li>1 teaspoon vanilla extract</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Sift together the flour, baking powder, ginger, nutmeg, cloves, and cinnamon; set aside.</li><li>In a medium bowl, mix together the shortening, molasses, brown sugar, water, egg, and vanilla until smooth. Gradually stir in the dry ingredients, until they are completely absorbed. Divide dough into 3 pieces, pat down to 1 1/2 inch thickness, wrap in plastic wrap, and refrigerate for at least 3 hours.</li><li>Preheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into desired shapes with cookie cutters. Place cookies 1 inch apart onto an ungreased cookie sheet.</li><li>Bake for 10 to 12 minutes in the preheated oven. When the cookies are done, they will look dry, but still be soft to the touch. Remove from the baking sheet to cool on wire racks. When cool, the cookies can be frosted with the icing of your choice.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in the chicken and stir in the chicken breasts in</li></ul>", "ttl": "Gingerbread Cookies II"}, "20663": {"actual": "<ul><li>4 eggs</li><li>1 cup white sugar</li><li>1 cup brown sugar</li><li>1/2 cup vegetable oil</li><li>1 teaspoon vanilla extract</li><li>3 1/2 cups all-purpose flour</li><li>1 1/2 teaspoons baking soda</li><li>1/2 teaspoon salt</li><li>2 teaspoons ground cinnamon</li><li>1/2 cup chopped walnuts</li><li>2 cups peeled, chopped zucchini</li><li>1 cup chopped, peeled apple</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C). Grease 2 - 9x5 inch loaf pans.</li><li>In a large bowl, combine eggs, white sugar, brown sugar, oil and vanilla until well blended. In a separate bowl, combine flour, baking soda, salt and cinnamon. Stir flour mixture into egg mixture. Fold in walnuts, zucchini and apple. Pour into prepared pans.</li><li>Bake 1 hour, or until top springs back when touched lightly in center. Let cool in pans 10 minutes before removing to wire rack to cool completely.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and stir in the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture to the center and the mixture</li></ul>", "ttl": "Zucchini Apple Bread"}, "9996": {"actual": "<ul><li>1/2 cup butter, softened</li><li>1/2 cup peanut butter</li><li>1 cup packed brown sugar</li><li>1/2 cup white sugar</li><li>2 eggs</li><li>2 tablespoons light corn syrup</li><li>2 tablespoons water</li><li>2 teaspoons vanilla extract</li><li>2 1/2 cups all-purpose flour</li><li>1 teaspoon baking soda</li><li>1/2 teaspoon salt</li><li>2 cups chopped semisweet chocolate</li><li>Preheat oven to 375 degrees F (190 degrees C).</li><li>In a large bowl, cream together the butter, peanut butter, brown sugar, and white sugar until smooth. Beat in the eggs one at a time, then stir in the corn syrup, water, and vanilla. Combine the flour, baking soda, and salt; stir into the peanut butter mixture. Fold in chocolate chunks. Drop by 1/4 cupfuls 3 inches apart onto ungreased baking sheets.</li><li>Bake for 12 to 14 minutes in the preheated oven, or until edges are golden. Allow cookies to cool for 1 minute on the cookie sheet before removing to wire racks to cool completely.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Chewy Peanut Butter Chocolate Chip Cookies"}, "26897": {"actual": "<ul><li>1 (16 ounce) package refrigerated pizza crust dough</li><li>4 ounces sliced provolone cheese</li><li>1 Bosc pear, thinly sliced</li><li>2 ounces chopped walnuts</li><li>2 1/2 ounces Gorgonzola cheese, crumbled</li><li>2 tablespoons chopped fresh chives</li><li>Preheat oven to 450 degrees F (230 degrees C).</li><li>Place pizza crust dough on a medium baking sheet. Layer with Provolone cheese. Top cheese with Bosc pear slices. Sprinkle with walnuts and Gorgonzola cheese.</li><li>Bake in the preheated oven 8 to 10 minutes, or until cheese is melted and crust is lightly browned. Remove from heat. Top with chives and slice to serve.</li><li></li></ul>", "rnn": "<ul><li>2 minutes. stir the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center and the chicken breasts in the center</li></ul>", "ttl": "Pear and Gorgonzola Cheese Pizza"}, "16690": {"actual": "<ul><li>1 pound Italian sausage</li><li>3/4 cup chopped onion</li><li>1 slice pancetta bacon, diced</li><li>1 1/4 teaspoons garlic, minced</li><li>1 cube chicken bouillon</li><li>4 cups water</li><li>2 potatoes, cubed</li><li>2 cups kale, rinsed and julienned</li><li>1/3 cup heavy cream</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 300 degrees F (150 degrees C).</li><li>Place sausage links on a sheet pan and bake for 15 to 20 minutes, or until done. Cut each link in half lengthwise, and then into 1/2 inch slices. Set aside for later.</li><li>In a 4 quart saucepan over medium heat, saute the onions and the pancetta for 10 minutes, or until onions are almost clear. Add the garlic and saute for one more minute. Add the chicken base OR bouillon, water and potatoes and bring to a simmer for 15 minutes. Add the kale, cream and reserved sausage, simmer for 5 more minutes and serve.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large bowl. to a large</li></ul>", "ttl": "Rich Italian Sausage and Potato Soup"}, "8990": {"actual": "<ul><li>2 skinless, boneless chicken breast halves</li><li>1 (10 ounce) can refrigerated pizza crust</li><li>1/2 cup Ranch-style salad dressing</li><li>1 cup shredded mozzarella cheese</li><li>1 cup shredded Cheddar cheese</li><li>1 cup chopped tomatoes</li><li>1/4 cup chopped green onions</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 425 degrees F (220 degrees C). Lightly grease a pizza pan or medium baking sheet.</li><li>Place chicken in a large skillet over medium-high heat. Cook until no longer pink, and juices run clear. Cool, then either shred or chop into small pieces.</li><li>Unroll dough, and press into the prepared pizza pan or baking sheet. Bake crust for 7 minutes in the preheated oven, or until it begins to turn golden brown. Remove from oven.</li><li>Spread ranch dressing over partially baked crust. Sprinkle on mozzarella cheese. Place tomatoes, green onion, and chicken on top of mozzarella cheese, then top with Cheddar cheese. Return to the oven for 20 to 25 minutes, until cheese is melted and bubbly.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175</li></ul>", "ttl": "Gourmet Chicken Pizza"}, "19125": {"actual": "<ul><li>1 tablespoon olive oil</li><li>1 tablespoon minced garlic</li><li>3 pounds skinless, boneless chicken breast halves</li><li>1 tablespoon paprika</li><li>1 cup brown sugar</li><li>1 cup red wine</li><li>salt and pepper to taste</li><li>Heat oil in a large skillet over medium high heat. Cook garlic in oil until tender. Place chicken in the skillet, and cook about 10 minutes on each side, until no longer pink and juices run clear.</li><li>Drain oil from skillet. Sprinkle chicken with paprika and 1 cup brown sugar. Pour red wine around chicken. Cover, and simmer about 15 to 20 minutes; lightly baste chicken with wine sauce while cooking. Season to taste with salt and pepper.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon dried the chicken breasts in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f</li></ul>", "ttl": "Chicken and Red Wine Sauce"}, "32513": {"actual": "<ul><li>1 cup pineapple juice</li><li>3 bananas, sliced</li><li>1 tablespoon honey</li><li>2 cups ice</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>In a blender, combine pineapple juice, bananas, honey and ice. Blend until smooth. Pour into glasses and serve.</li><li></li></ul>", "rnn": "<ul><li>1 tablespoon of the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until the chicken breasts in the preheated oven until</li></ul>", "ttl": "Banana Fruit Smoothie"}, "24878": {"actual": "<ul><li>1 (12 inch) pre-baked pizza crust</li><li>1 cup spicy barbeque sauce</li><li>2 skinless boneless chicken breast halves, cooked and cubed</li><li>1/2 cup chopped fresh cilantro</li><li>1 cup sliced pepperoncini peppers</li><li>1 cup chopped red onion</li><li>2 cups shredded Colby-Monterey Jack cheese</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>Place pizza crust on a medium baking sheet. Spread the crust with barbeque sauce. Top with chicken, cilantro, pepperoncini peppers, onion, and cheese.</li><li>Bake in the preheated oven for 15 minutes, or until cheese is melted and bubbly.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to the onion and garlic in the center should read at least 165 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees f (175 degrees</li></ul>", "ttl": "BBQ Chicken Pizza"}, "17186": {"actual": "<ul><li>2 tablespoons fresh lemon juice</li><li>3/4 cup butter</li><li>2 cloves garlic, crushed</li><li>1/4 teaspoon dried basil</li><li>1 teaspoon chopped pimento</li><li>1 cup chopped pecans</li><li>1 1/2 cups chopped fresh broccoli florets</li><li>1 small onion, minced</li><li>1/2 cup sour cream</li><li>1 (3 ounce) package cream cheese</li><li>8 skinless, boneless chicken breast halves</li><li>1 egg, beaten</li><li>1 cup dry bread crumbs</li><li>1/2 cup chopped pecans</li><li>1 tablespoon vegetable oil</li><li>Add all ingredients to list</li><li>Add all ingredients to list</li><li>To Make Broccoli/Cream Cheese Filling: In a medium saucepan over low heat, heat the lemon juice, butter or margarine, garlic, basil and pimento until butter or margarine has melted. Add the 1 cup pecans, broccoli and onion and cook until broccoli is tender; then add the sour cream and cream cheese and mix all together until smooth. Let cool, cover and refrigerate to chill for 30 minutes.</li><li>Place 1 to 2 tablespoons of the broccoli/cream cheese filling in the center of each chicken breast, roll up, tuck in sides and fasten with toothpicks. Put the egg beat in a shallow dish or bowl, and mix the bread crumbs and 1/2 cup pecans together in another shallow dish or bowl. Dip the chicken rolls in the egg, then in the pecan mixture.</li><li>Preheat oven to 350 degrees F (175 degrees C).</li><li>Heat oil in a large skillet over medium high heat and saute coated chicken rolls in skillet until well browned on both sides, about 2 to 4 minutes each side. Place browned rolls in a lightly greased 9x13 inch baking dish.</li><li>Bake at 350 degrees F (175 degrees C) for 30 minutes, or until chicken is cooked through and chicken meat is white. Serve with a small portion of leftover broccoli/cream cheese mixture on top of each chicken breast.</li><li></li></ul>", "rnn": "<ul><li>2 tablespoons olive oil in a large bowl. to a boil and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon dried cup chopped fresh and pepper to taste</li><li>1 tablespoon</li></ul>", "ttl": "Pecan Chicken Breasts Stuffed with Cream Cheese and Broccoli"}}